---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Viewer3dRenderSettings
source: html/6cdecd23-2757-a32b-497d-9c4cf3a1da5b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Viewer3dRenderSettings Property

"Rendering Settings"

## Syntax (C#)
```csharp
public static ForgeTypeId Viewer3dRenderSettings { get; }
```